
Monting Drive

In [57]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

Importing Pandas and Numpy

In [58]:
import pandas as pd
import numpy as np

Path of the drive

In [59]:
path = 'drive/MyDrive'

Reading the Dataset

In [60]:
df = pd.read_csv(f'{path}/AQ-Dataset/AirQualityUCI.csv', delimiter=';')

Dataframe

In [61]:
df

            Date      Time CO(GT)  ...      AH  Unnamed: 15 Unnamed: 16
0     10/03/2004  18.00.00    2,6  ...  0,7578          NaN         NaN
1     10/03/2004  19.00.00      2  ...  0,7255          NaN         NaN
2     10/03/2004  20.00.00    2,2  ...  0,7502          NaN         NaN
3     10/03/2004  21.00.00    2,2  ...  0,7867          NaN         NaN
4     10/03/2004  22.00.00    1,6  ...  0,7888          NaN         NaN
...          ...       ...    ...  ...     ...          ...         ...
9466         NaN       NaN    NaN  ...     NaN          NaN         NaN
9467         NaN       NaN    NaN  ...     NaN          NaN         NaN
9468         NaN       NaN    NaN  ...     NaN          NaN         NaN
9469         NaN       NaN    NaN  ...     NaN          NaN         NaN
9470         NaN       NaN    NaN  ...     NaN          NaN         NaN

[9471 rows x 17 columns]

Columns in the Dataframe

In [62]:
df.columns

Index(['Date', 'Time', 'CO(GT)', 'PT08.S1(CO)', 'NMHC(GT)', 'C6H6(GT)',
       'PT08.S2(NMHC)', 'NOx(GT)', 'PT08.S3(NOx)', 'NO2(GT)', 'PT08.S4(NO2)',
       'PT08.S5(O3)', 'T', 'RH', 'AH', 'Unnamed: 15', 'Unnamed: 16'],
      dtype='object')

Check if all the values in the column unnamed: 15 is Null

In [63]:
df['Unnamed: 15'].isna().all()

True

Check if all the values in the column unnamed: 16 is Null

In [64]:
df['Unnamed: 16'].isna().all()

True

Dropping Columns unnamed:15 and unnamed:16

In [65]:
df=df.drop(labels=['Unnamed: 15', 'Unnamed: 16'], axis=1)
print(df)

            Date      Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
0     10/03/2004  18.00.00    2,6       1360.0  ...       1268.0  13,6  48,9  0,7578
1     10/03/2004  19.00.00      2       1292.0  ...        972.0  13,3  47,7  0,7255
2     10/03/2004  20.00.00    2,2       1402.0  ...       1074.0  11,9  54,0  0,7502
3     10/03/2004  21.00.00    2,2       1376.0  ...       1203.0  11,0  60,0  0,7867
4     10/03/2004  22.00.00    1,6       1272.0  ...       1110.0  11,2  59,6  0,7888
...          ...       ...    ...          ...  ...          ...   ...   ...     ...
9466         NaN       NaN    NaN          NaN  ...          NaN   NaN   NaN     NaN
9467         NaN       NaN    NaN          NaN  ...          NaN   NaN   NaN     NaN
9468         NaN       NaN    NaN          NaN  ...          NaN   NaN   NaN     NaN
9469         NaN       NaN    NaN          NaN  ...          NaN   NaN   NaN     NaN
9470         NaN       NaN    NaN          NaN  ...          NaN   NaN   NaN     NaN

[9471 rows x 15 columns]

Dropping rows in which all the column values are null

In [66]:
df = df.dropna(how='all')
print(df)

            Date      Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
0     10/03/2004  18.00.00    2,6       1360.0  ...       1268.0  13,6  48,9  0,7578
1     10/03/2004  19.00.00      2       1292.0  ...        972.0  13,3  47,7  0,7255
2     10/03/2004  20.00.00    2,2       1402.0  ...       1074.0  11,9  54,0  0,7502
3     10/03/2004  21.00.00    2,2       1376.0  ...       1203.0  11,0  60,0  0,7867
4     10/03/2004  22.00.00    1,6       1272.0  ...       1110.0  11,2  59,6  0,7888
...          ...       ...    ...          ...  ...          ...   ...   ...     ...
9352  04/04/2005  10.00.00    3,1       1314.0  ...       1729.0  21,9  29,3  0,7568
9353  04/04/2005  11.00.00    2,4       1163.0  ...       1269.0  24,3  23,7  0,7119
9354  04/04/2005  12.00.00    2,4       1142.0  ...       1092.0  26,9  18,3  0,6406
9355  04/04/2005  13.00.00    2,1       1003.0  ...        770.0  28,3  13,5  0,5139
9356  04/04/2005  14.00.00    2,2       1071.0  ...        816.0  28,5  13,1  0,5028

[9357 rows x 15 columns]

Replacing -200 with an empty string

In [67]:
df.replace({'-200',''}, inplace=True)
print(df)

            Date      Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
0     10/03/2004  18.00.00    2,6       1360.0  ...       1268.0  13,6  48,9  0,7578
1     10/03/2004  19.00.00      2       1292.0  ...        972.0  13,3  47,7  0,7255
2     10/03/2004  20.00.00    2,2       1402.0  ...       1074.0  11,9  54,0  0,7502
3     10/03/2004  21.00.00    2,2       1376.0  ...       1203.0  11,0  60,0  0,7867
4     10/03/2004  22.00.00    1,6       1272.0  ...       1110.0  11,2  59,6  0,7888
...          ...       ...    ...          ...  ...          ...   ...   ...     ...
9352  04/04/2005  10.00.00    3,1       1314.0  ...       1729.0  21,9  29,3  0,7568
9353  04/04/2005  11.00.00    2,4       1163.0  ...       1269.0  24,3  23,7  0,7119
9354  04/04/2005  12.00.00    2,4       1142.0  ...       1092.0  26,9  18,3  0,6406
9355  04/04/2005  13.00.00    2,1       1003.0  ...        770.0  28,3  13,5  0,5139
9356  04/04/2005  14.00.00    2,2       1071.0  ...        816.0  28,5  13,1  0,5028

[9357 rows x 15 columns]

Changing data type of column time from object to string

In [68]:
print(df['Time'].dtypes)
df['Time']=df['Time'].astype('string')
print(df['Time'].dtypes)

object
string

Replacing the '.' with ':" to make the values in date format

In [69]:
df['Time']=df['Time'].str.replace('.',':')
print(df['Time'])

0       18:00:00
1       19:00:00
2       20:00:00
3       21:00:00
4       22:00:00
          ...
9352    10:00:00
9353    11:00:00
9354    12:00:00
9355    13:00:00
9356    14:00:00
Name: Time, Length: 9357, dtype: string

Data type of column 'Time' changed to datetime

In [70]:
df['Time']=pd.to_datetime(df['Time'])
print(df['Time'].dtypes)

datetime64[ns]

*   Replace ',' to '.' in column 'CO(GT)' 
*   Replace '.0' to empty string in column 'CO(GT)'

In [71]:
df['CO(GT)']=df['CO(GT)'].str.replace(',','.')
df['CO(GT)']=df['CO(GT)'].str.replace('.0','')
print(df['CO(GT)'])

0       2.6
1         2
2       2.2
3       2.2
4       1.6
       ...
9352    3.1
9353    2.4
9354    2.4
9355    2.1
9356    2.2
Name: CO(GT), Length: 9357, dtype: object

*   Filling the missing values with the last valid value in column 'CO(GT)'
*   Changing data type of column 'CO(GT)' to numeric
*   Check if there is any null values left in the column 'CO(GT)'

In [72]:
df['CO(GT)'].fillna(method='pad')
df['CO(GT)']=df['CO(GT)'].apply(pd.to_numeric,errors='coerce')
print(df['CO(GT)'].dtypes)
print(df['CO(GT)'].isna().all())
print(df['CO(GT)'])

float64
False
0       2.6
1       2.0
2       2.2
3       2.2
4       1.6
       ...
9352    3.1
9353    2.4
9354    2.4
9355    2.1
9356    2.2
Name: CO(GT), Length: 9357, dtype: float64

*   Replace ',' to '.' in column 'C6H6(GT)'
*   Replace '.0' to empty string in column 'C6H6(GT)'
*   Filling the missing values with the last valid value in column 'C6H6(GT)'
*   Changing data type of column 'C6H6(GT)' to numeric
*   Check if there is any null values left in the column 'C6H6(GT)'

In [73]:
df['C6H6(GT)']=df['C6H6(GT)'].str.replace(',','.')
df['C6H6(GT)']=df['C6H6(GT)'].str.replace('.0','')
df['C6H6(GT)'].fillna(method='pad')
df['C6H6(GT)']=df['C6H6(GT)'].apply(pd.to_numeric,errors='coerce')
print(df['C6H6(GT)'].dtypes)
print(df['C6H6(GT)'].isna().all())
print(df['C6H6(GT)'])

float64
False
0       11.9
1        9.4
2        9.0
3        9.2
4        6.5
        ...
9352    13.5
9353    11.4
9354    12.4
9355     9.5
9356    11.9
Name: C6H6(GT), Length: 9357, dtype: float64

*   Filling the missing values with the last valid value in column 'PT08.S2(NMHC)'
*   Check if there is any null values left in the column 'PT08.S2(NMHC)'

In [49]:
df['PT08.S2(NMHC)'].fillna(method='pad')
print(df['PT08.S2(NMHC)'].isna().all())
print(df['PT08.S2(NMHC)'])

False
0       1046.0
1        955.0
2        939.0
3        948.0
4        836.0
         ...
9352    1101.0
9353    1027.0
9354    1063.0
9355     961.0
9356    1047.0
Name: PT08.S2(NMHC), Length: 9357, dtype: float64

*   Filling the missing values with the last valid value in column 'NOx(GT)'
*   Check if there is any null values left in the column 'NOx(GT)'

In [74]:
df['NOx(GT)'].fillna(method='pad')
print(df['NOx(GT)'].isna().all())
print(df['NOx(GT)'])

False
0       166.0
1       103.0
2       131.0
3       172.0
4       131.0
        ...
9352    472.0
9353    353.0
9354    293.0
9355    235.0
9356    265.0
Name: NOx(GT), Length: 9357, dtype: float64

*   Filling the missing values with the last valid value in column 'NO2(GT)'
*   Check if there is any null values left in the column 'NO2(GT)'

In [75]:
df['NO2(GT)'].fillna(method='pad')
print(df['NO2(GT)'].isna().all())
print(df['NO2(GT)'])

False
0       113.0
1        92.0
2       114.0
3       122.0
4       116.0
        ...
9352    190.0
9353    179.0
9354    175.0
9355    156.0
9356    168.0
Name: NO2(GT), Length: 9357, dtype: float64

*   Filling the missing values with the last valid value in column 'PT08.S4(NO2)'
*   Check if there is any null values left in the column 'PT08.S4(NO2)'

In [76]:
df['PT08.S4(NO2)'].fillna(method='pad')
print(df['PT08.S4(NO2)'].isna().all())
print(df['PT08.S4(NO2)'])

False
0       1692.0
1       1559.0
2       1555.0
3       1584.0
4       1490.0
         ...
9352    1374.0
9353    1264.0
9354    1241.0
9355    1041.0
9356    1129.0
Name: PT08.S4(NO2), Length: 9357, dtype: float64

*   Filling the missing values with the last valid value in column 'PT08.S5(O3)'
*   Check if there is any null values left in the column 'PT08.S5(O3)'

In [77]:
df['PT08.S5(O3)'].fillna(method='pad')
print(df['PT08.S5(O3)'].isna().all())
print(df['PT08.S5(O3)'])

False
0       1268.0
1        972.0
2       1074.0
3       1203.0
4       1110.0
         ...
9352    1729.0
9353    1269.0
9354    1092.0
9355     770.0
9356     816.0
Name: PT08.S5(O3), Length: 9357, dtype: float64

*   Replace ',' to '.' in column 'T'
*   Filling the missing values with the last valid value in column 'T'
*   Changing data type of column 'T' to numeric
*   Check if there is any null values left in the column 'T'

In [78]:
df['T']=df['T'].str.replace(',','.')
df['T'].fillna(method='pad')
df['T']=df['T'].apply(pd.to_numeric,errors='coerce')
print(df['T'].isna().all())
print(df['T'])

False
0       13.6
1       13.3
2       11.9
3       11.0
4       11.2
        ...
9352    21.9
9353    24.3
9354    26.9
9355    28.3
9356    28.5
Name: T, Length: 9357, dtype: float64

*   Replace ',' to '.' in column 'RH'
*   Filling the missing values with the last valid value in column 'RH'
*   Changing data type of column 'RH' to numeric
*   Check if there is any null values left in the column 'RH'

In [79]:
df['RH']=df['RH'].str.replace(',','.')
df['RH'].fillna(method='pad')
df['RH']=df['RH'].apply(pd.to_numeric,errors='coerce')
print(df['RH'].isna().all())
print(df['RH'])

False
0       48.9
1       47.7
2       54.0
3       60.0
4       59.6
        ...
9352    29.3
9353    23.7
9354    18.3
9355    13.5
9356    13.1
Name: RH, Length: 9357, dtype: float64

*   Replace ',' to '.' in column 'AH'
*   Filling the missing values with the last valid value in column 'AH'
*   Changing data type of column 'AH' to numeric
*   Check if there is any null values left in the column 'AH'

In [80]:
df['AH']=df['AH'].str.replace(',','.')
df['AH'].fillna(method='pad')
df['AH']=df['AH'].apply(pd.to_numeric,errors='coerce')
print(df['AH'].isna().all())
print(df['AH'].dtypes)
print(df['AH'])

False
float64
0       0.7578
1       0.7255
2       0.7502
3       0.7867
4       0.7888
         ...
9352    0.7568
9353    0.7119
9354    0.6406
9355    0.5139
9356    0.5028
Name: AH, Length: 9357, dtype: float64

Changing the datatype of column 'date' to datetime

In [82]:
df['Date']=pd.to_datetime(df['Date'])
df['Date'].dtypes

dtype('<M8[ns]')

Final Dataframe

In [83]:
df

           Date                Time  CO(GT)  ...     T    RH      AH
0    2004-10-03 2021-03-05 18:00:00     2.6  ...  13.6  48.9  0.7578
1    2004-10-03 2021-03-05 19:00:00     2.0  ...  13.3  47.7  0.7255
2    2004-10-03 2021-03-05 20:00:00     2.2  ...  11.9  54.0  0.7502
3    2004-10-03 2021-03-05 21:00:00     2.2  ...  11.0  60.0  0.7867
4    2004-10-03 2021-03-05 22:00:00     1.6  ...  11.2  59.6  0.7888
...         ...                 ...     ...  ...   ...   ...     ...
9352 2005-04-04 2021-03-05 10:00:00     3.1  ...  21.9  29.3  0.7568
9353 2005-04-04 2021-03-05 11:00:00     2.4  ...  24.3  23.7  0.7119
9354 2005-04-04 2021-03-05 12:00:00     2.4  ...  26.9  18.3  0.6406
9355 2005-04-04 2021-03-05 13:00:00     2.1  ...  28.3  13.5  0.5139
9356 2005-04-04 2021-03-05 14:00:00     2.2  ...  28.5  13.1  0.5028

[9357 rows x 15 columns]